INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открытие участка  "Технологического института" до "Петроградской" в Ленинградском метрополитене $$,
$$ 1 июля 1963 года в Ленинграде открылись две новые станции метро: "Технологический институт-2" и "Петроградская", продлившие Московско-Петроградскую линию. Ключевым новшеством стало создание на "Технологическом институте" первого в СССР кросс-платформенного пересадочного узла, позволявшего удобно пересесть с Кировско-Выборгской линию прямо в одном зале. Станция "Петроградская" стала первой на одноименной стороне города, значительно улучшив транспортную доступность для жителей этого района. Это событие стало важным шагом в развитии ленинградского метрополитена. $$,
'https://ru.wikipedia.org/wiki/%D0%9F%D0%B5%D1%82%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%B4%D1%81%D0%BA%D0%B0%D1%8F',
'https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Metro_SPB_Line2_Petrogradskaya.jpg/500px-Metro_SPB_Line2_Petrogradskaya.jpg',
1963,
'--07-01'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открыта первая очередь центрального международного аэропорта «Внуково». $$,
$$ 2 июля 1941 года торжественно открылась первая очередь Центрального аэропорта «Внуково» под Москвой, ставшего первым аэропортом столицы, построенным "с нуля" по специальному проекту. Он был создан как новый мощный воздушный порт для разгрузки существовавшего аэродрома на Ходынском поле и получил название «Московский центральный аэропорт Внуково». Это событие имело огромное значение, так как уже через три недели после открытия аэропорт стал играть критически важную роль в обеспечении воздушных перевозок во время начавшейся Великой Отечественной войны. $$,
'https://ru.wikipedia.org/wiki/%D0%92%D0%BD%D1%83%D0%BA%D0%BE%D0%B2%D0%BE_(%D0%B0%D1%8D%D1%80%D0%BE%D0%BF%D0%BE%D1%80%D1%82)',
'https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Vnukovo_International_Airport_2019.jpg/500px-Vnukovo_International_Airport_2019.jpg',
1941,
'--07-02'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Июльские дни (Июльский кризис) $$,
$$ Массовые антиправительственные выступления солдат и рабочих в Петрограде под лозунгом "Вся власть Советам!", подавленные Временным правительством. $$,
'https://ru.wikipedia.org/wiki/%D0%98%D1%8E%D0%BB%D1%8C%D1%81%D0%BA%D0%B8%D0%B5_%D0%B4%D0%BD%D0%B8',
'https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/19170704_Riot_on_Nevsky_prosp_Petrograd.jpg/500px-19170704_Riot_on_Nevsky_prosp_Petrograd.jpg',
1917,
'--07-03'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открытие V Всероссийского съезда Советов $$,
$$ Съезд принял первую Конституцию РСФСР, законодательно оформившую новое советское государство. $$,
'https://ru.wikipedia.org/wiki/V_%D0%92%D1%81%D0%B5%D1%80%D0%BE%D1%81%D1%81%D0%B8%D0%B9%D1%81%D0%BA%D0%B8%D0%B9_%D1%81%D1%8A%D0%B5%D0%B7%D0%B4_%D0%A1%D0%BE%D0%B2%D0%B5%D1%82%D0%BE%D0%B2',
'https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Zinoviev_Sverdlov_Lashevich_Fifth_All-Russian_Congress_of_Soviets.jpg/500px-Zinoviev_Sverdlov_Lashevich_Fifth_All-Russian_Congress_of_Soviets.jpg',
1918,
'--07-04'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Начало Курской битвы $$,
$$ Начало крупнейшего танкового сражения в истории ("Огненная дуга"), завершившего коренной перелом в войне. $$,
'https://www.prlib.ru/history/619359',
'https://институтвоспитания.рф/upload/iblock/6b3/11wmw8zp9g5onynvla63u4qcdtfsk9m7.jpg',
1943,
'--07-05'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Официальное вступилое в силу решения о создании СССР $$,
$$ 6 июля 1923 года официально вступило в силу решение I Всесоюзного съезда Советов об образовании Союза Советских Социалистических Республик (СССР). В этот день II сессия ЦИК СССР приняла и ввела в действие первую Конституцию СССР, а также сформировала первое союзное правительство — Совет Народных Комиссаров (Совнарком) во главе с В. И. Лениным и образовала первые общесоюзные народные комиссариаты (наркоматы), ставшие центральными органами исполнительной власти нового государства. Это событие формально завершило процесс создания единого союзного государства на основе ранее подписанного Договора об образовании СССР. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D0%BE%D1%8E%D0%B7_%D0%A1%D0%BE%D0%B2%D0%B5%D1%82%D1%81%D0%BA%D0%B8%D1%85_%D0%A1%D0%BE%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85_%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA',
'https://sun9-75.userapi.com/s/v1/ig2/345O8sE5IwgmM6umPT_S6hiZeyticUvWWhJvcqhQTe6DxgijEsqXDjdIE53zSLDR6rplJiI4GhjfKTrfPVi73pCn.jpg?quality=95&as=32x22,48x33,72x49,108x74,160x109,240x164,360x246,480x328,540x370,640x438,700x479&from=bu&cs=700x479',
1923,
'--07-06'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Официальное открытие Московского парка Победы в Ленинграде $$,
$$ 7 июля 1946 года в Ленинграде торжественно открылся Московский парк Победы — первый в СССР мемориальный парк, созданный в честь победы в Великой Отечественной войне. Он был построен силами горожан на месте бывших городских окраин и стал живым памятником подвигу ленинградцев, переживших блокаду. $$,
'https://ru.wikipedia.org/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D0%BF%D0%B0%D1%80%D0%BA_%D0%9F%D0%BE%D0%B1%D0%B5%D0%B4%D1%8B_(%D0%A1%D0%B0%D0%BD%D0%BA%D1%82-%D0%9F%D0%B5%D1%82%D0%B5%D1%80%D0%B1%D1%83%D1%80%D0%B3)',
'https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Park_Pobedy_SPB_3.jpg/500px-Park_Pobedy_SPB_3.jpg',
1946,
'--07-07'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Введение почётного звания «Мать-героиня», ордена «Материнская слава» и медали «Медаль материнства» $$,
$$ 8 июля 1944 года Указом Президиума Верховного Совета СССР были учреждены высшая степень отличия — звание «Мать-героиня» (для матерей, родивших и воспитавших 10 и более детей), а также орден «Материнская слава» (3 степеней) и медаль «Медаль материнства» (2 степеней) для награждения многодетных матерей. Эти награды стали важной частью государственной политики по поддержке материнства и стимулированию рождаемости в послевоенные годы. $$,
'https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%82%D1%8C-%D0%B3%D0%B5%D1%80%D0%BE%D0%B8%D0%BD%D1%8F_(%D0%A1%D0%A1%D0%A1%D0%A0)',
'https://cdnstatic.rg.ru/crop600x860/uploads/images/2024/07/02/n-vatolina-1944-g_74e.jpg',
1944,
'--07-08'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ В Петербурге заложен мост Петра Великого (ныне — Большеохтинский) $$,
$$ 9 июля 1909 года в Санкт-Петербурге состоялась торжественная закладка моста Императора Петра Великого (ныне Большеохтинский) через Неву. Этот величественный трехпролетный мост с уникальным однокрылым разводным механизмом стал одним из последних крупных дореволюционных сооружений города и важной транспортной артерией, соединившей центр с Охтинским районом. $$,
'https://ru.wikipedia.org/wiki/%D0%91%D0%BE%D0%BB%D1%8C%D1%88%D0%B5%D0%BE%D1%85%D1%82%D0%B8%D0%BD%D1%81%D0%BA%D0%B8%D0%B9_%D0%BC%D0%BE%D1%81%D1%82',
'https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Bolsheokhtinsky_Bridge_SPB_02.jpg/500px-Bolsheokhtinsky_Bridge_SPB_02.jpg',
1909,
'--07-09'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Вступление в должность президента России Б. Н. Ельцина $$,
$$ 10 июля 1991 года в Кремле состоялась торжественная церемония вступления Бориса Николаевича Ельцина в должность первого в истории Президента России (тогда РСФСР). $$,
'https://ru.wikipedia.org/wiki/%D0%95%D0%BB%D1%8C%D1%86%D0%B8%D0%BD,_%D0%91%D0%BE%D1%80%D0%B8%D1%81_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87#%D0%9F%D1%80%D0%B5%D0%B7%D0%B8%D0%B4%D0%B5%D0%BD%D1%82_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8_(1991%E2%80%941999)',
'https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/%D0%91%D0%BE%D1%80%D0%B8%D1%81_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87_%D0%95%D0%BB%D1%8C%D1%86%D0%B8%D0%BD-1_%28cropped%29_%28cropped%29.jpg/500px-%D0%91%D0%BE%D1%80%D0%B8%D1%81_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87_%D0%95%D0%BB%D1%8C%D1%86%D0%B8%D0%BD-1_%28cropped%29_%28cropped%29.jpg',
1991,
'--07-10'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Введение в строй газопровода Саратов - Москва $$,
$$ 11 июля 1946 года был торжественно введен в эксплуатацию первый в СССР магистральный газопровод "Саратов — Москва" протяженностью 843 км. Это событие положило начало созданию Единой системы газоснабжения страны и обеспечило столицу дешевым топливом, что имело огромное значение для послевоенного восстановления экономики и улучшения жизни москвичей. $$,
'https://ru.wikipedia.org/wiki/%D0%93%D0%B0%D0%B7%D0%BE%D0%BF%D1%80%D0%BE%D0%B2%D0%BE%D0%B4_%D0%A1%D0%B0%D1%80%D0%B0%D1%82%D0%BE%D0%B2_%E2%80%94_%D0%9C%D0%BE%D1%81%D0%BA%D0%B2%D0%B0',
'https://e-news.su/uploads/posts/2024-07/1720686062_photo_2024-07-11_12-40-21.jpg',
1946,
'--07-11'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Подписание мирного договора между Литвой и РСФСР $$,
$$ 12 июля 1920 года в Москве был подписан Мирный договор между РСФСР и Литовской Республикой, ставший первым международным актом, в котором Советская Россия официально признала независимость и суверенитет Литвы в её этнографических границах. Договор зафиксировал передачу Литве спорного Виленского края (хотя уже осенью 1920 года Вильнюс был занят Польшей) и установил границу между государствами, положив конец военным действиям. $$,
'https://ru.wikipedia.org/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D0%B4%D0%BE%D0%B3%D0%BE%D0%B2%D0%BE%D1%80_(%D0%A0%D0%A1%D0%A4%D0%A1%D0%A0_%E2%80%94_%D0%9B%D0%B8%D1%82%D0%B2%D0%B0,_1920)',
'https://nashi-dni.su/images/%D0%BD%D1%83%D0%BB%D0%B5%D0%B2%D0%B0%D1%8F_%D0%BF%D0%B0%D0%BF%D0%BA%D0%B0/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D0%B4%D0%BE%D0%B3%D0%BE%D0%B2%D0%BE%D1%80_1920_%D0%9B%D0%B0%D1%82%D0%B2%D0%B8%D1%8F.JPG',
1920,
'--07-12'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Начало Львовско-Сандомирской операции $$,
$$ 13 июля 1944 года началась стратегическая Львовско-Сандомирская наступательная операция войск 1-го Украинского фронта под командованием маршала И. С. Конева. Эта мощная операция привела к разгрому немецкой группы армий «Северная Украина», освобождению Западной Украины (включая Львов 27 июля) и созданию крупного Сандомирского плацдарма на западном берегу Вислы в Польше, что открыло путь для дальнейшего наступления на Берлин. $$,
'https://ru.wikipedia.org/wiki/%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D1%81%D0%BA%D0%BE-%D0%A1%D0%B0%D0%BD%D0%B4%D0%BE%D0%BC%D0%B8%D1%80%D1%81%D0%BA%D0%B0%D1%8F_%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D1%8F',
'https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Lvov-Sandomierz_Offensive.jpg/500px-Lvov-Sandomierz_Offensive.jpg',
1944,
'--07-13'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Принятие закона СССР «О государственных пенсиях» $$,
$$ 14 июля 1956 года Верховный Совет СССР принял Закон «О государственных пенсиях», установивший единую общесоюзную систему пенсионного обеспечения для рабочих и служащих. Этот закон впервые гарантировал право на пенсию по старости для мужчин с 60 лет (при стаже 25 лет) и женщин с 55 лет (при стаже 20 лет), заложив основы современной пенсионной системы страны. $$,
'https://sfr.gov.ru/branches/pskov/news~2017/07/14/139031',
'https://sfr.gov.ru/files/branches/pskov/20170714_zakon_o_pensiyah.jpg',
1956,
'--07-14'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Старт космического корабля "Союз-19" $$,
$$ Начало миссии по программе ЭПАС (Экспериментальный полет "Аполлон-Союз"), первой в истории стыковке космических кораблей СССР и США. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D0%BE%D1%8E%D0%B7-19',
'https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Soyuz_19_%28Apollo_Soyuz_Test_Project%29_spacecraft.jpg/500px-Soyuz_19_%28Apollo_Soyuz_Test_Project%29_spacecraft.jpg',
1975,
'--07-15'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ В освобождённом Минске прошёл Партизанский парад $$,
$$ 16 июля 1944 года в только что освобожденном от нацистов Минске состоялся грандиозный Партизанский парад, в котором участвовало около 30 тысяч бойцов белорусских партизанских бригад. Колонны с оружием и трофеями прошли по разрушенному городу, демонстрируя огромный вклад народного сопротивления в освобождение Белоруссии, всего через 6 дней после вступления в Минск Красной Армии. $$,
'https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D1%80%D1%82%D0%B8%D0%B7%D0%B0%D0%BD%D1%81%D0%BA%D0%B8%D0%B9_%D0%BF%D0%B0%D1%80%D0%B0%D0%B4',
'https://www.warmuseum.by/images/news/019/07/18072019_2.jpg',
1944,
'--07-16'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Расстрел царской семьи $$,
$$ Николай II, его семья и слуги были расстреляны в подвале Ипатьевского дома в Екатеринбурге по решению Уральского совета. $$,
'https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D1%81%D1%81%D1%82%D1%80%D0%B5%D0%BB_%D1%86%D0%B0%D1%80%D1%81%D0%BA%D0%BE%D0%B9_%D1%81%D0%B5%D0%BC%D1%8C%D0%B8',
'https://img.gazeta.ru/files3/43/11847043/rasstrel-pic4_zoom-1500x1500-29168.jpg',
1918,
'--07-17'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Начало Сталинградской битвы $$,
$$ Начало оборонительной фазы величайшего сражения Второй мировой войны на подступах к Сталинграду. $$,
'https://www.prlib.ru/history/619395',
'https://upload.wikimedia.org/wikipedia/commons/e/e8/%D0%A4%D0%BE%D0%BD%D1%82%D0%B0%D0%BD_%C2%AB%D0%94%D0%B5%D1%82%D1%81%D0%BA%D0%B8%D0%B9_%D1%85%D0%BE%D1%80%D0%BE%D0%B2%D0%BE%D0%B4%C2%BB.jpg',
1942,
'--07-17'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Захоронение останков царской семьи $$,
$$ Останки Николая II, его семьи и слуг торжественно захоронены в Петропавловском соборе Санкт-Петербурга. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D1%83%D0%B4%D1%8C%D0%B1%D0%B0_%D0%BE%D1%81%D1%82%D0%B0%D0%BD%D0%BA%D0%BE%D0%B2_%D1%86%D0%B0%D1%80%D1%81%D0%BA%D0%BE%D0%B9_%D1%81%D0%B5%D0%BC%D1%8C%D0%B8',
'https://cdnn21.img.ria.ru/images/150967/76/1509677691_0:142:3712:2229_1280x0_80_0_0_765375449d07c9fd8ecbc9451b313c6b.jpg.webp',
1998,
'--07-17'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ По дну Ладожского озера проложен трубопровод для подачи топлива в осаждённый Ленинград $$,
$$ 18 июля 1942 года по дну Ладожского озера был введён в эксплуатацию уникальный подводный трубопровод длиной 29 км (из них 21 км под водой) для подачи горючего в осаждённый Ленинград. Спроектированный и проложенный в рекордные сроки (43 дня) под постоянными обстрелами, он стал "артерией жизни", ежесуточно доставляя до 150 тонн бензина и керосина для войск Ленинградского фронта и нужд города. $$,
'https://tatfrontu.ru/news/18-iyulya-1942-goda-po-dnu-ladozhskogo-ozera-prolozhen-truboprovod-dlya-podachi-topliva-v',
'https://tatfrontu.ru/sites/default/files/styles/1600_1600/public/img/2022/07/19/dmgnpeg9fgavjxcwz9x6uj40nbf-dxxc1lq6carwuoneu2ddi9metxepilzzzwkjgaxsqjt3c1dymbivosmdrv4.jpg?itok=Gt91QWNN',
1942,
'--07-18'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открытие II конгресса Коминтерна $$,
$$ В Петрограде открылся II конгресс Коммунистического Интернационала (Коминтерна), определивший условия вступления партий. $$,
'https://ru.wikipedia.org/wiki/%D0%92%D1%82%D0%BE%D1%80%D0%BE%D0%B9_%D0%BA%D0%BE%D0%BD%D0%B3%D1%80%D0%B5%D1%81%D1%81_%D0%9A%D0%BE%D0%BC%D0%BC%D1%83%D0%BD%D0%B8%D1%81%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE_%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%B0%D0%BB%D0%B0',
'https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/2nd_World_Congress_of_the_Comintern_Lenin_Zinoviev_Bukharin_Gorky.jpg/500px-2nd_World_Congress_of_the_Comintern_Lenin_Zinoviev_Bukharin_Gorky.jpg',
1920,
'--07-19'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открытие XXII Летних Олимпийских игр $$,
$$ В Москве открылись первые в истории Олимпийские игры на территории социалистической страны. Проходили до 3 августа. $$,
'https://ru.wikipedia.org/wiki/%D0%9B%D0%B5%D1%82%D0%BD%D0%B8%D0%B5_%D0%9E%D0%BB%D0%B8%D0%BC%D0%BF%D0%B8%D0%B9%D1%81%D0%BA%D0%B8%D0%B5_%D0%B8%D0%B3%D1%80%D1%8B_1980',
'https://lublino-mos.ru/files/lyublino/news/2021/07.19/2.jpg',
1980,
'--07-19'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Пол Маккартни приступил к записи альбома «Снова в СССР» $$,
$$ 20 июля 1987 года Пол Маккартни начал запись альбома «Снова в СССР» (Back in the U.S.S.R.) — сборника каверов на классику рок-н-ролла 1950-х. Этот необычный проект, записанный практически в одиночку (Маккартни сыграл на всех инструментах), стал его личным подарком поклонникам в СССР, где официальная музыка The Beatles долго запрещалась. Альбом, вдохновленный визитом в Москву в 1987 году, изначально распространялся только на территории Советского Союза. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D0%BD%D0%BE%D0%B2%D0%B0_%D0%B2_%D0%A1%D0%A1%D0%A1%D0%A0',
'https://upload.wikimedia.org/wikipedia/ru/b/ba/%D0%A1%D0%BD%D0%BE%D0%B2%D0%B0_%D0%B2_%D0%A1%D0%A1%D0%A1%D0%A0.png',
1987,
'--07-20'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Первый налёт немецкой авиации на Москву $$,
$$ 21 июля 1941 года произошел первый массированный налёт люфтваффе на Москву, в котором участвовало около 220 немецких бомбардировщиков. Несмотря на разрушения в городе (пострадали Кремль, Театр Вахтангова, жилые кварталы) и гибель мирных жителей, советская ПВО и истребители отразили атаку, сбив не менее 22 самолётов противника. Этот налёт ознаменовал начало пятимесячной Битвы за Москву с воздуха, в ходе которой столица пережила 141 воздушную тревогу. $$,
'https://xn--b1ae4ad.xn--p1ai/calendar/1941-7-21_pervaya-nalet-nemetskoy-aviatsii-na-moskvu',
'https://denvistorii.ru/sites/default/files/2016-07/Bomb_Moscow.jpg',
1941,
'--07-21'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ При пожаре в Ясной Поляне уничтожены рукописи Льва Толстого. $$,
$$ 22 июля 1910 года в усадьбе Ясная Поляна произошел разрушительный пожар в каменном флигеле, где хранился личный архив Льва Николаевича Толстого. Огонь уничтожил бесценные рукописи писателя, включая черновики незавершенных произведений, дневники последних лет и переписку, что стало невосполнимой утратой для мировой литературы. Трагедия произошла через восемь месяцев после ухода Толстого из Ясной Поляны и глубоко потрясла его семью и общественность. $$,
'https://xn--b1ae4ad.xn--p1ai/facts/rukopisi-ne-goryat-uvy-oni-goryat',
'https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Lev_Nikolayevich_Tolstoy_in_1910_by_Vladimir_Chertkov.jpg/500px-Lev_Nikolayevich_Tolstoy_in_1910_by_Vladimir_Chertkov.jpg',
1910,
'--07-22'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Запуск космического корабля ''Союз-37'' $$,
$$ 23 июля 1980 года с космодрома Байконур стартовал космический корабль «Союз-37» с международным экипажем: командир Виктор Горбатко (СССР) и космонавт-исследователь Фам Туан (первый космонавт Вьетнама и Юго-Восточной Азии). Основной задачей полета была стыковка с орбитальной станцией «Салют-6» для проведения совместных советско-вьетнамских научных экспериментов, ставшая важным шагом программы «Интеркосмос». Фам Туан стал 138-м космонавтом мира и первым представителем своей страны в космосе. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D0%BE%D1%8E%D0%B7-37',
'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTxsIpivbu5_ZLfIeBru72DmHdwtdnFgKiBiA&s',
1980,
'--07-23'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ "Кухонные дебаты" $$,
$$ 24 июля 1959 года на Американской национальной выставке в московском парке «Сокольники» вице-президент США Ричард Никсон и Председатель Совета Министров СССР Никита Хрущёв вступили в импровизированную публичную дискуссию у макета типичного американского дома ("кухня"). Их жаркий спор о достоинствах капитализма и социализма, уровня жизни и технологий, транслировавшийся по телевидению, стал одним из самых ярких символов идеологической конфронтации эпохи холодной войны и получил название "Кухонные дебаты". $$,
'https://ru.wikipedia.org/wiki/%D0%9A%D1%83%D1%85%D0%BE%D0%BD%D0%BD%D1%8B%D0%B5_%D0%B4%D0%B5%D0%B1%D0%B0%D1%82%D1%8B',
'https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/1959_Khrushchev%2C_Nixon%2C_Brezhnev.jpg/500px-1959_Khrushchev%2C_Nixon%2C_Brezhnev.jpg',
1959,
'--07-24'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Принятие постановления о введении всеобщего начального обучения. $$,
$$ 25 июля 1930 года ЦК ВКП(б) принял постановление «О всеобщем обязательном начальном обучении», предписывавшее с 1930/1931 учебного года ввести в СССР обязательное бесплатное обучение всех детей (мальчиков и девочек) в возрасте 8–10 лет. Это решение стало ключевым этапом в ликвидации неграмотности и создании единой общедоступной школьной системы, обеспечившей массовую подготовку кадров для индустриализации страны. $$,
'https://www.prlib.ru/history/619410',
'https://russiangiant.ru/wp-content/uploads/2022/07/Rhvxrhnb0PL5bigh1AcS6qhoXa-6ziC8cQjHcqCP5oXWpctNuvMmx6TZ8QWGLv7Kpwn1qdRAjJH9UCDDcsn1YTtM.jpg',
1930,
'--07-25'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Публикация статьи Ленина, призывающей к поражению своего правительства в мировой войне. $$,
$$ 26 июля 1915 года в швейцарской газете «Социал-Демократ» была опубликована программная статья В. И. Ленина «Социализм и война», где он впервые сформулировал стратегию революционного пораженчества: призвал рабочих к превращению империалистической войны в гражданскую, а также к поражению «своего» правительства в Первой мировой войне как пути к свержению царизма. Эта позиция вызвала шок даже среди многих соратников по РСДРП(б) и стала идеологической основой для будущей Октябрьской революции. $$,
'https://von-hoffmann.livejournal.com/2561353.html',
'https://sun1-20.userapi.com/c857036/v857036242/18034b/bxWGYB2bK-8.jpg',
1915,
'--07-26'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Освобождение Львова в ходе Львовско-Сандомирской операции $$,
$$ 27 июля 1944 года войска 1-го Украинского фронта под командованием Маршала И. С. Конева в ходе Львовско-Сандомирской операции освободили Львов от немецко-фашистских захватчиков. Город был взят стремительным штурмом с применением танковых армий (в частности, 3-й гвардейской танковой армии П. С. Рыбалко), что позволило избежать уличных боёв и сохранить архитектурные памятники. Освобождение Львова стало ключевым успехом операции, открывшим путь к Польше и предгорьям Карпат. $$,
'https://ru.wikipedia.org/wiki/%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D1%81%D0%BA%D0%BE-%D0%A1%D0%B0%D0%BD%D0%B4%D0%BE%D0%BC%D0%B8%D1%80%D1%81%D0%BA%D0%B0%D1%8F_%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D1%8F',
'https://icdn.lenta.ru/images/2024/07/11/10/20240711104750322/wide_16_9_73051b814bfc1650b16aa98afb1fc0f8.jpg',
1944,
'--07-27'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Многотысячные похороны Владимира Высоцкого в Москве $$,
$$ 28 июля 1980 года в Москве состоялись многотысячные похороны Владимира Высоцкого, собравшие у Театра на Таганке и вдоль пути следования траурной процессии до Ваганьковского кладбища десятки тысяч людей, несмотря на официальное замалчивание события в СМИ из-за проведения Олимпиады-80. Прощание в театре длилось три дня, а спонтанный гражданский ритуал с цветами и стихийными чтениями стихов поэта стал одним из самых массовых проявлений народной любви в СССР к неофициальному кумиру. Это событие, организованное театром и близкими вопреки давлению властей, превратилось в легенду о победе искренней памяти над идеологическими запретами. $$,
'https://ru.wikipedia.org/wiki/%D0%92%D1%8B%D1%81%D0%BE%D1%86%D0%BA%D0%B8%D0%B9,_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%A1%D0%B5%D0%BC%D1%91%D0%BD%D0%BE%D0%B2%D0%B8%D1%87#%D0%9F%D0%BE%D1%85%D0%BE%D1%80%D0%BE%D0%BD%D1%8B',
'https://cdn.culture.ru/images/ff6057c3-0ba9-57ed-aebe-c0d993a87513/w_1020,c_fill,g_center/1-jpg',
1980,
'--07-28'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Учреждение орденов: Суворова трёх степеней; Кутузова двух степеней; Александра Невского. $$,
$$ 29 июля 1942 года Указом Президиума Верховного Совета СССР были учреждены полководческие ордена: Суворова (I, II и III степени), Кутузова (I и II степени) и Александра Невского. Эти награды, созданные в разгар Сталинградской битвы, предназначались для командного состава Красной Армии за выдающиеся заслуги в планировании и проведении боевых операций, став символом возрождения традиций русской военной славы. $$,
'https://ru.wikipedia.org/wiki/%D0%9E%D1%80%D0%B4%D0%B5%D0%BD_%D0%A1%D1%83%D0%B2%D0%BE%D1%80%D0%BE%D0%B2%D0%B0',
'https://bibliotekar.ru/4-1-78-ordena-velikoy-otechestvennoy-voyny/3.files/image001.jpg',
1942,
'--07-29'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ В Ленинграде открыт стадион им. С. М. Кирова $$,
$$ 30 июля 1950 года в Ленинграде торжественно открылся стадион имени С. М. Кирова на Крестовском острове — крупнейшая спортивная арена СССР своего времени, построенная на месте бывшего Комендантского аэродрома. Грандиозный комплекс в стиле сталинского ампира с колоннадой и 100-тысячными трибунами стал символом возрождения города после блокады и главной площадкой для футбола, легкой атлетики и массовых мероприятий на следующие полвека. $$,
'https://ru.wikipedia.org/wiki/%D0%A1%D1%82%D0%B0%D0%B4%D0%B8%D0%BE%D0%BD_%D0%B8%D0%BC%D0%B5%D0%BD%D0%B8_%D0%9A%D0%B8%D1%80%D0%BE%D0%B2%D0%B0',
'https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/KirovskiyStadion_29140.jpg/500px-KirovskiyStadion_29140.jpg',
1950,
'--07-30'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Начало массовых казней „врагов народа“ по приказу НКВД $$,
$$ 30 июля 1937 года нарком НКВД Н. И. Ежов подписал Приказ № 00447 «Об операции по репрессированию бывших кулаков, уголовников и других антисоветских элементов», санкционировавший массовые аресты и расстрелы по заранее установленным квотам («лимитам»). Эта операция, стартовавшая 5 августа 1937 года, стала ключевым механизмом «Большого террора» — по официальным отчётам НКВД, в ходе неё были осуждены 767?397 человек (включая 386?798 расстрелянных), а реальные цифры жертв могут быть выше. $$,
'https://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%B8%D0%BA%D0%B0%D0%B7_%D0%9D%D0%9A%D0%92%D0%94_%D0%A1%D0%A1%D0%A1%D0%A0_%E2%84%96_00447',
'https://nkvd.tomsk.ru/content/files/00/da/a4/72eAw6fdQi9U.jpg',
1937,
'--07-30'
);
INSERT INTO events (name, description, source_url, image_url, event_year, event_date) VALUES (
$$ Открытие Центрального стадиона им. В. И. Ленина в Лужниках. $$,
$$ 31 июля 1956 года в Москве торжественно открылся Центральный стадион имени В. И. Ленина в Лужниках — крупнейший спортивный комплекс СССР, построенный в рекордные 450 дней по инициативе Н. С. Хрущёва. Грандиозная арена на 101 тысячу зрителей, возведённая силами комсомольцев на месте бывшей свалки, стала символом «оттепели» и главной площадкой VI Всемирного фестиваля молодёжи 1957 года. $$,
'https://ru.wikipedia.org/wiki/%D0%9B%D1%83%D0%B6%D0%BD%D0%B8%D0%BA%D0%B8_(%D1%81%D1%82%D0%B0%D0%B4%D0%B8%D0%BE%D0%BD)',
'https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/LuzhnikiStadium.jpg/500px-LuzhnikiStadium.jpg',
1956,
'--07-31'
);
